In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\shiva\appdata\local\programs\python\python312\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\shiva\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.4.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\shiva\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\shiva\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\shiva\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\shiva\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [9]:

import pandas as pd

In [10]:
# Data to series from
marks = 88,99,78,65,84
std_marks=pd.Series(marks)
print(marks)

(88, 99, 78, 65, 84)

In [11]:
# Convert Dta to Series
marks = pd.Series([88,99,78,65,84],index=["Math","Science","English","Hindi","Geo"])
print(marks)

Math       88
Science    99
English    78
Hindi      65
Geo        84
dtype: int64

In [12]:
print(marks[0:3])

Math       88
Science    99
English    78
dtype: int64

In [13]:
# Update
marks["Hindi"]=98
print(marks)

Math       88
Science    99
English    78
Hindi      98
Geo        84
dtype: int64

In [14]:
# Updateing Series by index numbers
marks[4]=75
print(marks)

Math       88
Science    99
English    78
Hindi      98
Geo        75
dtype: int64

C:\Users\shiva\AppData\Local\Temp\ipykernel_20196\2501723731.py:2: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  marks[4]=75

In [15]:
# Performing some Arithmatic function
upd_marks=pd.Series([88,99,78,65,84])
print(upd_marks+6)

0     94
1    105
2     84
3     71
4     90
dtype: int64

In [16]:
# Indentifying Missing Values in DataSet
missing_marks=pd.Series([88,None,78,None,84])
print(missing_marks)

0    88.0
1     NaN
2    78.0
3     NaN
4    84.0
dtype: float64

In [17]:
# Handaling Missing Values
missing_marks.fillna(0,inplace=True)
print(missing_marks)

0    88.0
1     0.0
2    78.0
3     0.0
4    84.0
dtype: float64

In [18]:
import pandas as pd

In [19]:
# DataFrame - Two dimensiol data with Rows & Columns
data={
    "Name":["Soni","Priya","Shipra","Sakshi","Ankita"],
    "Age":[20,21,22,23,24],
    "Trade":["AIPA","CSA","EM","COPA","COSMO"]
}

df=pd.DataFrame(data)
print(df)

     Name  Age  Trade
0    Soni   20   AIPA
1   Priya   21    CSA
2  Shipra   22     EM
3  Sakshi   23   COPA
4  Ankita   24  COSMO

In [20]:
# multiple columns select
df[["Name","Trade"]]

     Name  Trade
0    Soni   AIPA
1   Priya    CSA
2  Shipra     EM
3  Sakshi   COPA
4  Ankita  COSMO

In [21]:
df["Trade"]

0     AIPA
1      CSA
2       EM
3     COPA
4    COSMO
Name: Trade, dtype: object

In [22]:
# Finding by lable base intiger
df.loc[3]

Name     Sakshi
Age          23
Trade      COPA
Name: 3, dtype: object

In [23]:
# Return values by position even if the index lable is different
df.iloc[3]

Name     Sakshi
Age          23
Trade      COPA
Name: 3, dtype: object

In [28]:
# Filter Data

In [24]:
df[df["Age"]>23]

     Name  Age  Trade
4  Ankita   24  COSMO

In [25]:
df[(df["Age"]>20) & (df["Trade"]=="COPA") & (df["Name"]=="Sakshi")]

     Name  Age Trade
3  Sakshi   23  COPA

In [6]:
 # Sorting Data

In [26]:
df.sort_values(by="Trade")

     Name  Age  Trade
0    Soni   20   AIPA
3  Sakshi   23   COPA
4  Ankita   24  COSMO
1   Priya   21    CSA
2  Shipra   22     EM

In [27]:
df.sort_values(by="Name",ascending=False)

     Name  Age  Trade
0    Soni   20   AIPA
2  Shipra   22     EM
3  Sakshi   23   COPA
1   Priya   21    CSA
4  Ankita   24  COSMO

In [42]:
data={
    "Name":["Amit","Ajeet","Raj","Vivek","Sonu"],
    "Marks":[85,None,83,70,88]
}
df=pd.DataFrame(data)

In [43]:
# Check null values
df.isnull()

    Name  Marks
0  False  False
1  False   True
2  False  False
3  False  False
4  False  False

In [44]:
# Fill null by specify values
df.fillna(70)

    Name  Marks
0   Amit   85.0
1  Ajeet   70.0
2    Raj   83.0
3  Vivek   70.0
4   Sonu   88.0

In [45]:
# Fill missing values t= with average of other values
df["Marks"].fillna(df["Marks"].mean(),inplace=True)

C:\Users\shiva\AppData\Local\Temp\ipykernel_20196\2360709910.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Marks"].fillna(df["Marks"].mean(),inplace=True)

In [33]:
# Grouping Data
data={
    "Trade":["AIPA","AIPA","COSMO","CSA","COPA","COSMO","CSA"],
    "Students":[20,20,40,35,30,20,40]
}
df=pd.DataFrame(data)

In [46]:
df

    Name  Marks
0   Amit   85.0
1  Ajeet   81.5
2    Raj   83.0
3  Vivek   70.0
4   Sonu   88.0

In [38]:
df.groupby("Trade")["Students"].sum()

Trade
AIPA     40
COPA     30
COSMO    60
CSA      75
Name: Students, dtype: int64

In [39]:
df.groupby("Trade")["Students"].mean()

Trade
AIPA     20.0
COPA     30.0
COSMO    30.0
CSA      37.5
Name: Students, dtype: float64

In [40]:
df.groupby("Trade")["Students"].count()

Trade
AIPA     2
COPA     1
COSMO    2
CSA      2
Name: Students, dtype: int64

In [41]:
# Used for summerizing data
df.groupby("Trade")["Students"].agg(["sum","mean","count"])

       sum  mean  count
Trade
AIPA    40  20.0      2
COPA    30  30.0      1
COSMO   60  30.0      2
CSA     75  37.5      2

In [47]:
df=pd.read_csv("salesdata.csv")
df

     ID    Name   Age  State Sales
0     1    Amit  25.0     UP  5000
1     2    Neha  22.0  Delhi  7000
2     3    Ravi   NaN  Bihar  6000
3     4  Sunita  28.0     UP   NaN
4     5    Anil  35.0  Delhi  8000
..  ...     ...   ...    ...   ...
95   96  Alisha  23.0  Bihar  4600
96   97   Shyam   NaN  Delhi  8300
97   98  Poonam  25.0     UP  5400
98   99   Vinod  40.0  Bihar  8900
99  100    Riya  22.0  Delhi   NaN

[100 rows x 5 columns]

In [48]:
# Find missing values
df.isnull()

       ID   Name    Age  State  Sales
0   False  False  False  False  False
1   False  False  False  False  False
2   False  False   True  False  False
3   False  False  False  False   True
4   False  False  False  False  False
..    ...    ...    ...    ...    ...
95  False  False  False  False  False
96  False  False   True  False  False
97  False  False  False  False  False
98  False  False  False  False  False
99  False  False  False  False   True

[100 rows x 5 columns]

In [58]:
# COUNT 
df.isna().sum()

ID       0
Name     0
Age      0
State    0
Sales    0
dtype: int64

In [50]:
df.head()

   ID    Name   Age  State Sales
0   1    Amit  25.0     UP  5000
1   2    Neha  22.0  Delhi  7000
2   3    Ravi   NaN  Bihar  6000
3   4  Sunita  28.0     UP   NaN
4   5    Anil  35.0  Delhi  8000

In [51]:
df.tail()

     ID    Name   Age  State Sales
95   96  Alisha  23.0  Bihar  4600
96   97   Shyam   NaN  Delhi  8300
97   98  Poonam  25.0     UP  5400
98   99   Vinod  40.0  Bihar  8900
99  100    Riya  22.0  Delhi   NaN

In [52]:
df["Sales"].fillna(6500,inplace=True)

C:\Users\shiva\AppData\Local\Temp\ipykernel_20196\3848287492.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Sales"].fillna(6500,inplace=True)

In [54]:
 df["Age"].fillna(df["Age"].mean(),inplace=True)

C:\Users\shiva\AppData\Local\Temp\ipykernel_20196\2763411152.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Age"].fillna(df["Age"].mean(),inplace=True)

In [57]:
df["State"].fillna(df["State"].mode()[0],inplace=True)

C:\Users\shiva\AppData\Local\Temp\ipykernel_20196\416756345.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["State"].fillna(df["State"].mode()[0],inplace=True)

In [56]:
df

     ID    Name        Age  State Sales
0     1    Amit  25.000000     UP  5000
1     2    Neha  22.000000  Delhi  7000
2     3    Ravi  30.917647  Bihar  6000
3     4  Sunita  28.000000     UP  6500
4     5    Anil  35.000000  Delhi  8000
..  ...     ...        ...    ...   ...
95   96  Alisha  23.000000  Bihar  4600
96   97   Shyam  30.917647  Delhi  8300
97   98  Poonam  25.000000     UP  5400
98   99   Vinod  40.000000  Bihar  8900
99  100    Riya  22.000000  Delhi  6500

[100 rows x 5 columns]

In [59]:
df["State"].unique()

array(['UP', 'Delhi', 'Bihar', 'delhi', 'Up'], dtype=object)

In [61]:
df["State"]=df["State"].str.title()

In [62]:
df["State"].unique()

array(['Up', 'Delhi', 'Bihar'], dtype=object)

In [63]:
df

     ID    Name        Age  State Sales
0     1    Amit  25.000000     Up  5000
1     2    Neha  22.000000  Delhi  7000
2     3    Ravi  30.917647  Bihar  6000
3     4  Sunita  28.000000     Up  6500
4     5    Anil  35.000000  Delhi  8000
..  ...     ...        ...    ...   ...
95   96  Alisha  23.000000  Bihar  4600
96   97   Shyam  30.917647  Delhi  8300
97   98  Poonam  25.000000     Up  5400
98   99   Vinod  40.000000  Bihar  8900
99  100    Riya  22.000000  Delhi  6500

[100 rows x 5 columns]

In [64]:
dup=df.duplicated()

In [65]:
df.duplicated().sum()

np.int64(0)

In [66]:
print(dup.sum())

0